IDENTIFICATION DIVISION.
PROGRAM-ID. MEUPROGRAMA.
DATA DIVISION.
WORKING-STORAGE SECTION.
    01 valorInicial PIC 9(5)V99999 VALUE 12.5.
    01 somaTotal PIC A(6).
    01 mediaAritmetica PIC X(7).
PROCEDURE DIVISION.
MAIN-PROCEDURE.

DISPLAY "Amigo estou trabalhando"

ACCEPT somaTotal

STOP RUN.
END PROGRAM MEUPROGRAMA.
